//Original Sigma Rule: https://github.com/Neo23x0/sigma/blob/master/rules/windows/process_creation/win_susp_schtask_creation.yml
//Questions via Twitter: @janvonkirchheim 
DeviceEvents 
| where ActionType == "ScheduledTaskCreated"
  and InitiatingProcessAccountSid != "S-1-5-18"
