// Finding base64 encoded PE files header seen in the command line parameters
// Tags: #fileLess  #powershell
DeviceProcessEvents
| where Timestamp > ago(7d)
| where ProcessCommandLine contains "TVqQAAMAAAAEAAA"
| top 1000 by Timestamp
