// Query 1 shows you any network communication happened from endpoints to a specific Remote IP or Remote URL
// Ensure to update RemoteIP and RemoteURL variable.
// For questions @MiladMSFT on Twitter or milad.aslaner@microsoft.com by email
DeviceNetworkEvents
| where RemoteIP == "IP ADDRESS GOES HERE"
or RemoteUrl endswith "DNS ENTRY GOES HERE"
| project Timestamp, DeviceName, ActionType, RemoteIP, RemoteUrl, InitiatingProcessFileName, InitiatingProcessCommandLine

// Query 2 shows you any network communication that happened from endpoints through a specific file to an Remote IP or Remote URL
//Ensure to update RemoteIP, RemoteURL and InitatingProcessFileName
// For questions @MiladMSFT on Twitter or milad.aslaner@microsoft.com by email
let IP = "IP ADDRESS GOES HERE";
let DNS = "DNS ENTRY GOES HERE";
let FILENAME = "FILENAME GOES HERE";
DeviceNetworkEvents
| where (RemoteIP == IP or RemoteUrl endswith DNS) and InitiatingProcessFileName =~ FILENAME
| project Timestamp, DeviceName, ActionType, RemoteIP, RemoteUrl, InitiatingProcessFileName, InitiatingProcessCommandLine

// Query 3 allows you to find network communication to an IP or URL in the DeviceNetworkEvents table, as well as in DeviceEvents for other events (SmartScreen, launch browser with URL, more)
// Ensure to update RemoteIP and RemoteURL variable.
find in (DeviceEvents, DeviceNetworkEvents)
where RemoteIP == "IP ADDRESS GOES HERE" or RemoteUrl =~ "URL GOES HERE"
project DeviceName, ActionType, FileName, Timestamp

// Query 4 Search for specific network communication of a Remote IP or URL that also discovers related file creation events
// Ensure to update RemoteIP and RemoteURL variable.
DeviceFileEvents
| where FileOriginUrl == "IP ADDRESS GOES HERE" or FileOriginUrl contains "URL GOES HERE" or FileOriginReferrerUrl contains "URL GOES HERE"
| project DeviceName, Timestamp, FileName, FileOriginUrl, FileOriginIP, FileOriginReferrerUrl, SHA1
