// Find attempts to stop System Restore and 
// prevent the system from creating restore points
DeviceProcessEvents  
| where Timestamp > ago(7d)  
// Pivoting for rundll32  
and InitiatingProcessFileName =~ 'rundll32.exe'   
// Looking for empty command line   
and isnotempty(InitiatingProcessCommandLine)  
// Looking for schtasks.exe as the created process  
and FileName in~ ('schtasks.exe')  
// Disabling system restore   
and ProcessCommandLine has 'Change' and ProcessCommandLine has 'SystemRestore' 
and ProcessCommandLine has 'disable'